/* Создать массив чисел от 1 до 10. Отфильтровать его таким образом, 
что бы мы получил массив чисел, начиная с 5.*/

const numbers = [1,2,3,4,5,6,7,8,9,10];
const newNumbers = numbers.filter (number => number>=5);

console.log (newNumbers);

/* Создать массив строк, относящихся к любой сущности
(название фильмов/книг, кухонные приборы, мебель и т.д.), 
проверить, есть ли в массиве какая-то определенная сущность.*/

const kitchenAppliances = ["Тостер", "Блендер", "Чайник", "Микроволновка", "Кофемашина"];

const hasItem = kitchenAppliances.includes("Тостер");
console.log (hasItem);

/* Написать функцию, которая аргументом 
будет принимать массив и изменять его порядок на противоположный ("переворачивать") .
Два вышеуказанных массива с помощью этой функции перевернуть.*/

function reversArray (array) {array.reverse ()
console.log (array);
}

reversArray (numbers);
reversArray (kitchenAppliances);

/* Добавить файл comments.js, в нём создать константу и в него 
поместить первые 10 объектов этого (ссылкка) массива. Данный массив представляет
собой пример комментариев в соц. сетях, поэтому переменная должна быть названа по смыслу.
Не забудьте удалить квадратные кавычки у ключей объектов 
(можно использовать Chat GPT, что бы не делать это вручную)*/

